If true style has markers and text settings.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public bool HasMarkersAndTextSettings()
  Visual Basic
Public Function HasMarkersAndTextSettings As Boolean
  Visual C++
public:
bool HasMarkersAndTextSettings()
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace